In [1]:
# Import Libraries:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt
import seaborn as sns
import altair as alt

/var/folders/1c/2l3t80fd68337kqkdg5w4dqr0000gn/T/ipykernel_14362/4281249191.py:2: DeprecationWarning:
Pyarrow will become a required dependency of pandas in the next major release of pandas (pandas 3.0),
(to allow more performant data types, such as the Arrow string type, and better interoperability with other libraries)
but was not found to be installed on your system.
If this would cause problems for you,
please provide us feedback at https://github.com/pandas-dev/pandas/issues/54466

  import pandas as pd

### Read Data

In [2]:
ntp_df = pd.read_csv("data/ntp_delivery_data_2023-12-14.csv")

In [3]:
deprive_df = pd.read_csv("data/IMD2019-Table 1.csv")

In [4]:
deprive_df.columns

Index(['LSOA code (2011)', 'LSOA name (2011)',
       'Local Authority District code (2019)',
       'Local Authority District name (2019)',
       'Index of Multiple Deprivation (IMD) Rank',
       'Index of Multiple Deprivation (IMD) Decile'],
      dtype='object')

In [5]:
ntp_df

,academic_year,time_period,time_identifier,geographic_level,country_code,country_name,region_code,region_name,old_la_code,new_la_code,la_name,total_type,school_phase,estimated_course_starts_by_pupils,total_schools,total_schools_participating,percentage_schools_participating
0,202324,2023,October,National,E92000001,England,NaN,NaN,NaN,NaN,NaN,Total since start of NTP,All,4932327,-,-,-
1,202021,2021,August,National,E92000001,England,NaN,NaN,NaN,NaN,NaN,Total in academic year,All,310717,-,-,-
2,202122,2022,August,National,E92000001,England,NaN,NaN,NaN,NaN,NaN,Total in academic year,All,2215386,-,-,-
3,202223,2023,August,National,E92000001,England,NaN,NaN,NaN,NaN,NaN,Total in academic year,All,2060618,21623,15316,70.8
4,202324,2023,October,National,E92000001,England,NaN,NaN,NaN,NaN,NaN,Total in academic year,Primary,199923,16772,5758,34.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
165,202324,2023,October,Local authority,E92000001,England,E12000003,Yorkshire and The Humber,815.0,E10000023,North Yorkshire,Total in academic year,All,2697,356,111,31.2
166,202324,2023,October,Local authority,E92000001,England,E12000003,Yorkshire and The Humber,372.0,E08000018,Rotherham,Total in academic year,All,1476,120,42,35
167,202324,2023,October,Local authority,E92000001,England,E12000003,Yorkshire and The Humber,373.0,E08000019,Sheffield,Total in academic year,All,3490,177,69,39
168,202324,2023,October,Local authority,E92000001,England,E12000003,Yorkshire and The Humber,384.0,E08000036,Wakefield,Total in academic year,All,2677,138,41,29.7
169,202324,2023,October,Local authority,E92000001,England,E12000003,Yorkshire and The Humber,816.0,E06000014,York,Total in academic year,All,524,62,12,19.4

In [6]:
ntp_df.columns

Index(['academic_year', 'time_period', 'time_identifier', 'geographic_level',
       'country_code', 'country_name', 'region_code', 'region_name',
       'old_la_code', 'new_la_code', 'la_name', 'total_type', 'school_phase',
       'estimated_course_starts_by_pupils', 'total_schools',
       'total_schools_participating', 'percentage_schools_participating'],
      dtype='object')

In [7]:
# check dtypes
ntp_df.dtypes

academic_year                          int64
time_period                            int64
time_identifier                       object
geographic_level                      object
country_code                          object
country_name                          object
region_code                           object
region_name                           object
old_la_code                          float64
new_la_code                           object
la_name                               object
total_type                            object
school_phase                          object
estimated_course_starts_by_pupils      int64
total_schools                         object
total_schools_participating           object
percentage_schools_participating      object
dtype: object

In [8]:
# replace all instance of "-" with true nans
ntp_df.replace("-", np.nan, inplace=True)

In [9]:
# create dtype dict
ntp_dtype_dict = ntp_df.dtypes.apply(lambda x: x.name).to_dict()

In [10]:
ntp_dtype_dict

{'academic_year': 'int64',
 'time_period': 'int64',
 'time_identifier': 'object',
 'geographic_level': 'object',
 'country_code': 'object',
 'country_name': 'object',
 'region_code': 'object',
 'region_name': 'object',
 'old_la_code': 'float64',
 'new_la_code': 'object',
 'la_name': 'object',
 'total_type': 'object',
 'school_phase': 'object',
 'estimated_course_starts_by_pupils': 'int64',
 'total_schools': 'object',
 'total_schools_participating': 'object',
 'percentage_schools_participating': 'object'}

In [11]:
# create new ntp_dict
new_ntp_dict = {'academic_year': 'int64',
 'time_period': 'int64',
 'time_identifier': 'object',
 'geographic_level': 'object',
 'country_code': 'object',
 'country_name': 'object',
 'region_code': 'object',
 'region_name': 'object',
 'old_la_code': 'float64',
 'new_la_code': 'object',
 'la_name': 'object',
 'total_type': 'object',
 'school_phase': 'object',
 'estimated_course_starts_by_pupils': 'int64',
 'total_schools': 'int64',
 'total_schools_participating': 'int64',
 'percentage_schools_participating': 'float64'}

In [12]:
ntp_df['total_schools'] = ntp_df['total_schools'].fillna(0)
ntp_df['total_schools_participating'] = ntp_df['total_schools_participating'].fillna(0)

In [13]:
def convert_dataframe_dtypes(df, dtype_dict):
    """
    Convert the data types of specified columns in a DataFrame.
    """
    for column, dtype in dtype_dict.items():
        if column in df.columns:
            df[column] = df[column].astype(dtype)
    return df

In [14]:
test_convert = convert_dataframe_dtypes(df=ntp_df, dtype_dict=new_ntp_dict)

In [15]:
test_convert

,academic_year,time_period,time_identifier,geographic_level,country_code,country_name,region_code,region_name,old_la_code,new_la_code,la_name,total_type,school_phase,estimated_course_starts_by_pupils,total_schools,total_schools_participating,percentage_schools_participating
0,202324,2023,October,National,E92000001,England,NaN,NaN,NaN,NaN,NaN,Total since start of NTP,All,4932327,0,0,NaN
1,202021,2021,August,National,E92000001,England,NaN,NaN,NaN,NaN,NaN,Total in academic year,All,310717,0,0,NaN
2,202122,2022,August,National,E92000001,England,NaN,NaN,NaN,NaN,NaN,Total in academic year,All,2215386,0,0,NaN
3,202223,2023,August,National,E92000001,England,NaN,NaN,NaN,NaN,NaN,Total in academic year,All,2060618,21623,15316,70.8
4,202324,2023,October,National,E92000001,England,NaN,NaN,NaN,NaN,NaN,Total in academic year,Primary,199923,16772,5758,34.3
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
165,202324,2023,October,Local authority,E92000001,England,E12000003,Yorkshire and The Humber,815.0,E10000023,North Yorkshire,Total in academic year,All,2697,356,111,31.2
166,202324,2023,October,Local authority,E92000001,England,E12000003,Yorkshire and The Humber,372.0,E08000018,Rotherham,Total in academic year,All,1476,120,42,35.0
167,202324,2023,October,Local authority,E92000001,England,E12000003,Yorkshire and The Humber,373.0,E08000019,Sheffield,Total in academic year,All,3490,177,69,39.0
168,202324,2023,October,Local authority,E92000001,England,E12000003,Yorkshire and The Humber,384.0,E08000036,Wakefield,Total in academic year,All,2677,138,41,29.7
169,202324,2023,October,Local authority,E92000001,England,E12000003,Yorkshire and The Humber,816.0,E06000014,York,Total in academic year,All,524,62,12,19.4

In [16]:
ntp_df.dtypes

academic_year                          int64
time_period                            int64
time_identifier                       object
geographic_level                      object
country_code                          object
country_name                          object
region_code                           object
region_name                           object
old_la_code                          float64
new_la_code                           object
la_name                               object
total_type                            object
school_phase                          object
estimated_course_starts_by_pupils      int64
total_schools                          int64
total_schools_participating            int64
percentage_schools_participating     float64
dtype: object

In [17]:
ntp_df.describe()

,academic_year,time_period,old_la_code,estimated_course_starts_by_pupils,total_schools,total_schools_participating,percentage_schools_participating
count,170.000000,170.000000,153.000000,1.700000e+02,170.000000,170.000000,167.000000
mean,202320.435294,2022.982353,616.745098,6.412631e+04,636.017647,271.129412,37.234731
std,28.849106,0.171092,279.899219,4.423692e+05,2688.889132,1385.878341,10.113869
min,202021.000000,2021.000000,201.000000,0.000000e+00,0.000000,0.000000,0.000000
25%,202324.000000,2023.000000,335.000000,1.288000e+03,74.250000,27.000000,31.000000
50%,202324.000000,2023.000000,807.000000,2.091500e+03,100.000000,40.000000,36.000000
75%,202324.000000,2023.000000,874.000000,3.456000e+03,199.250000,69.750000,41.800000
max,202324.000000,2023.000000,943.000000,4.932327e+06,21625.000000,15316.000000,100.000000

In [18]:
ntp_df.groupby(["region_name"])["total_schools_participating"].count()

region_name
East Midlands               11
East of England             12
London                      34
North East                  13
North West                  25
South East                  20
South West                  16
West Midlands               15
Yorkshire and The Humber    16
Name: total_schools_participating, dtype: int64

In [19]:
ntp_df.groupby(["region_name"])["total_schools_participating"].sum()

region_name
East Midlands               1368
East of England             1854
London                      2238
North East                   696
North West                  2390
South East                  2300
South West                  1476
West Midlands               1584
Yorkshire and The Humber    1482
Name: total_schools_participating, dtype: int64

In [20]:
ntp_df.groupby(["region_name"])["total_schools"].sum()

region_name
East Midlands               4106
East of England             5058
London                      5014
North East                  2236
North West                  6256
South East                  6702
South West                  4710
West Midlands               4736
Yorkshire and The Humber    4432
Name: total_schools, dtype: int64

In [21]:
ntp_df.groupby(["region_name"])["estimated_course_starts_by_pupils"].sum()

region_name
East Midlands                54694
East of England              62906
London                      145726
North East                   34474
North West                  109082
South East                   87490
South West                   47274
West Midlands                77206
Yorkshire and The Humber     72360
Name: estimated_course_starts_by_pupils, dtype: int64

### Clean Data

### Join Data

### Visualise Data

### Summary: